[
  {
    "course_code": 101,
    "course_name": "C Programming",
    "course_image": "https://iili.io/DrYLfn.md.webp",
    "course_description": "C is a structured, procedural programming language that has been widely used both for operating systems and applications and has had a wide following in the academic community. Many versions of UNIX-based operating systems are written in C.C, a basic Programming Language. So one should Learn it .",
    "Duration": 12,
    "Price": 1000,
    "Rating": 5,
    "instructor_id": 1,
    "Instructor_name": "Adham Arik Rahman"
  },
  {
    "course_code": 102,
    "course_name": "C++ Programming",
    "course_image": "https://iili.io/DrYDJf.md.png",
    "course_description": "C++ is an object-oriented programming language which gives a clear structure to programs and allows code to be reused, lowering development costs. C++ is portable and can be used to develop applications that can be adapted to multiple platforms. C++ is fun and easy to learn!",
    "Duration": 15,
    "Price": 1000,
    "Rating": 7,
    "instructor_id": 1,
    "Instructor_name": "Adham Arik Rahman"
  },
  {
    "course_code": 103,
    "course_name": "Java Programming",
    "course_image": "https://iili.io/Dra30u.md.webp",
    "course_description": "Java is a widely used object-oriented programming language and software platform that runs on billions of devices, including notebook computers, mobile devices, gaming consoles, medical devices and many others. The rules and syntax of Java are based on the C and C++ languages.",
    "Duration": 20,
    "Price": 1500,
    "Rating": 6,
    "instructor_id": 1,
    "Instructor_name": "Adham Arik Rahman"
  },
  {
    "course_code": 201,
    "course_name": "Python Programming",
    "course_image": "https://iili.io/DraCbV.md.webp",
    "course_description": "Python is a computer programming language often used to build websites and software, automate tasks, and conduct data analysis. Python is a general-purpose language, meaning it can be used to create a variety of different programs and isn't specialized for any specific problems.",
    "Duration": 15,
    "Price": 2000,
    "Rating": 6,
    "instructor_id": 2,
    "Instructor_name": "Mishal Al Rahman"
  },
  {
    "course_code": 202,
    "course_name": "Graphics Design",
    "course_image": "https://iili.io/Dra2fe.md.jpgImages/courses image/graphic.png",
    "course_description": "Graphic design is a craft where professionals create visual content to communicate messages. By applying visual hierarchy and page layout techniques, designers use typography and pictures to meet users' specific needs and focus on the logic of displaying elements in interactive designs, to optimize the user experience.",
    "Duration": 10,
    "Price": 1000,
    "Rating": 7,
    "instructor_id": 2,
    "Instructor_name": "Mishal Al Rahman"
  },
  {
    "course_code": 203,
    "course_name": "Algorithms",
    "course_image": "https://iili.io/DrYpb2.md.png",
    "course_description": "An algorithm is a procedure used for solving a problem or performing a computation. Algorithms act as an exact list of instructions that conduct specified actions step by step in either hardware- or software-based routines. Algorithms are widely used throughout all areas of IT.",
    "Duration": 20,
    "Price": 3000,
    "Rating": 9,
    "instructor_id": 2,
    "Instructor_name": "Mishal Al Rahman"
  },
  {
    "course_code": 301,
    "course_name": "Data Structure",
    "course_image": "https://iili.io/DrYZUG.md.jpg",
    "course_description": "A data structure is a specialized format for organizing, processing, retrieving and storing data. There are several basic and advanced types of data structures, all designed to arrange data to suit a specific purpose. Data structures make it easy for users to access and work with the data they need in appropriate ways.",
    "Duration": 25,
    "Price": 2500,
    "Rating": 9,
    "instructor_id": 3,
    "Instructor_name": "Asir Sadat"
  },
  {
    "course_code": 302,
    "course_name": "Machine Learning",
    "course_image": "https://iili.io/DraBOQ.md.jpg",
    "course_description": "Machine learning (ML) is a type of artificial intelligence (AI) that allows software applications to become more accurate at predicting outcomes without being explicitly programmed to do so. Machine learning algorithms use historical data as input to predict new output values.",
    "Duration": 30,
    "Price": 5000,
    "Rating": 10,
    "instructor_id": 3,
    "Instructor_name": "Asir Sadat"
  },
  {
    "course_code": 401,
    "course_name": "Database Management",
    "course_image": "https://iili.io/DrafJj.md.jpg",
    "course_description": "Database Management allows a person to organize, store, and retrieve data from a computer. Database Management can also describe the data storage, operations, and security practices of a database administrator (DBA) throughout the life cycle of the data.",
    "Duration": 19,
    "Price": 2000,
    "Rating": 6,
    "instructor_id": 4,
    "Instructor_name": "Nafiul Quddus Onim"
  },
  {
    "course_code": 402,
    "course_name": "Web Architecture",
    "course_image": "https://iili.io/Draq5x.md.jpg",
    "course_description": "Web architecture is the process of designing, creating and implementing an internet-based computer program. Often, these programs are websites that contain useful information for a user, and web developers may design these programs for a particular purpose, company or brand.",
    "Duration": 20,
    "Price": 5000,
    "Rating": 8,
    "instructor_id": 4,
    "Instructor_name": "Nafiul Quddus Onim"
  },
  {
    "course_code": 403,
    "course_name": "Artificial Intelligence",
    "course_image": "https://iili.io/DrYQls.md.jpg",
    "course_description": "Artificial intelligence (AI) refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions. The term may also be applied to any machine that exhibits traits associated with a human mind such as learning and problem-solving.",
    "Duration": 20,
    "Price": 3000,
    "Rating": 7,
    "instructor_id": 4,
    "Instructor_name": "Nafiul Quddus Onim"
  },
  {
    "course_code": 303,
    "course_name": "Data Mining",
    "course_image": "https://iili.io/DraFUb.md.jpg",
    "course_description": "Data mining is the process of finding anomalies, patterns and correlations within large data sets to predict outcomes. Using a broad range of techniques, you can use this information to increase revenues, cut costs, improve customer relationships, reduce risks and more.",
    "Duration": 22,
    "Price": 2500,
    "Rating": 7,
    "instructor_id": 3,
    "Instructor_name": "Asir Sadat"
  },
  {
    "course_code": 501,
    "course_name": "Web Programming",
    "course_image": "https://iili.io/DraozB.md.jpg",
    "course_description": "Web programming refers to the writing, markup, and coding involved in Web development, which includes Web content, Web client and server scripting, and network security. The most common languages used for Web programming are XML, HTML, JavaScript, Perl 5, and PHP.",
    "Duration": 22,
    "Price": 5000,
    "Rating": 8,
    "instructor_id": 5,
    "Instructor_name": "Tanvir Ahmed Khan"
  },
  {
    "course_code": 502,
    "course_name": "Digital Image Processing",
    "course_image": "https://iili.io/DraJs9.md.jpg",
    "course_description": "Digital image processing is the use of a digital computer to process digital images through an algorithm. As a subcategory or field of digital signal processing, digital image processing has many advantages over analog image processing. It allows a much wider range of algorithms to be applied to the input data and can avoid problems such as the build-up of noise and distortion during processing. Since images are defined over two dimensions (perhaps more) digital image processing may be modeled in the form of multidimensional systems. The generation and development of digital image processing are mainly affected by three factors: first, the development of computers; second, the development of mathematics (especially the creation and improvement of discrete mathematics theory); third, the demand for a wide range of applications in environment, agriculture, military, industry and medical science has increased.",
    "Duration": 25,
    "Price": 6000,
    "Rating": 9,
    "instructor_id": 5,
    "Instructor_name": "Tanvir Ahmed Khan"
  },
  {
    "course_code": 503,
    "course_name": "Digital Signal Processing",
    "course_image": "https://iili.io/DrYmOl.md.jpg",
    "course_description": "Digital signal processing (DSP) is the process of analyzing and modifying a signal to optimize or improve its efficiency or performance. It involves applying various mathematical and computational algorithms to analog and digital signals to produce a signal that's of higher quality than the original signal.",
    "Duration": 25,
    "Price": 3500,
    "Rating": 7,
    "instructor_id": 5,
    "Instructor_name": "Tanvir Ahmed Khan"
  }
]